app/controllers/v1/courses_controller.rb

    def destroy
      course.destroy!
---
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 4]]