app/controllers/v1/students_controller.rb

DELETE FROM "students" WHERE "students"."id" = $1  [["id", 5]]
---
    def destroy
      student.destroy