app/controllers/v1/teachers_controller.rb

    def destroy
      teacher.destroy
---
DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 2]]