app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("name", "surname", "email", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Lucas"], ["surname", "del Rio"], ["email", "gmail.com"], ["phone_number", 32424234], ["created_at", "2020-04-14 17:06:36.285217"], ["updated_at", "2020-04-14 17:06:36.285217"]]
---
  def create
    teacher = Teacher.new(teacher_params)

    if teacher.save

DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 11]]
---
  def destroy
    teacher.destroy